
#### Terraform Format and Style 🖌: success
#### Terraform Initialization ⚙️: success
#### Terraform Validation 🤖: Success! The configuration is valid.


#### Terraform Plan 📖: success
<details><summary>Show Plan</summary>

```
terraform
module.git.github_repository.devops_challenge: Refreshing state... [id=devops-challenge-teamsoft]
module.s3.aws_s3_bucket.server_terraform_bucket: Refreshing state... [id=devops-challenge-teamsoft-terraform-bucket]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.git.github_repository.devops_challenge has changed
  ~ resource "github_repository" "devops_challenge" {
      ~ etag                        = "W/\"4f2c2ae917258194ef9aac550a43d1e8ea50d22f1127edd7845b32e5cf515471\"" -> "W/\"0cbcf5002d5c204393f032668143e87e82d12b22bada299682253e206b47e308\""
        id                          = "devops-challenge-teamsoft"
        name                        = "devops-challenge-teamsoft"
        # (33 unchanged attributes hidden)

      + security_and_analysis {

          + secret_scanning {
              + status = "enabled"
            }

          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.git.github_actions_secret.devops_challenge_aws_access_key_id will be created
  + resource "github_actions_secret" "devops_challenge_aws_access_key_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "devops-challenge-teamsoft"
      + secret_name     = "AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.git.github_actions_secret.devops_challenge_aws_secret_access_key will be created
  + resource "github_actions_secret" "devops_challenge_aws_secret_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "devops-challenge-teamsoft"
      + secret_name     = "AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pusher: @thandioque, Action: pull_request, Working Directory: terraform, Workflow: Terraform plan*